---
kind: property
id: P:Autodesk.Revit.DB.Mullion.LocationCurve
source: html/34d3408e-03e2-d268-5c3e-0551f115e7af.htm
---
# Autodesk.Revit.DB.Mullion.LocationCurve Property

This method get the curve location of the current Mullion.

## Syntax (C#)
```csharp
public Curve LocationCurve { get; }
```